public class LabQ3Hard {
    /*  โจทย์
     *  ข้อนี้ไม่ให้อะไรมาเลย จงเขียนขึ้นมาเอง และเป็น method ดูตัวอย่างได้จากข้อที่ง่ายกว่า
     *  เขียนโปรแกรมเพื่อเช็คว่า มี sub word นั้นใน word ไหม
     *  ข้อมูลนำเข้า:
     *      บรรทัดแรกรับข้อความ word หมายถึงคำทั้งหมดเข้ามา
     *      บรรทัดสองรับข้อความ sub word หมายถึงคำย่อยที่ต้องการหาใน word เข้ามา
     *  ข้อมูลส่งออก:
     *      ค่าความจริง มี subword ใน word ไหม
     * 
     *  ตัวอย่าง:
     *      ข้อมูลนำเข้า:
     *          KMITL
     *          MIT
     *      ข้อมูลส่งออก:
     *          true
     *      อธิบาย:
     *          ข้อความ KMITL มี MIT อยู่เป็น sub word
     * 
     * ตัวอย่าง:
     *      ข้อมูลนำเข้า:
     *          CScamp17
     *          Cs
     *      ข้อมูลส่งออก:
     *          false
     *      อธิบาย:
     *          ข้อความ CScamp17 มี CS เป็นตัวพิมพ์ใหญ่ทั้งสอง แต่ sub word ของเราคือ Cs พิมพ์ใหญ่ และ พิมพ์เล็ก จึงไม่ตรงกัน
     */
    public static void main(String[] args) {
        
    }
}